import pandas as pd


# 브롤러:미스터,로봇,깡통
# 모드:핫존
# 스킨:바이러스,비비,닌자,큐피트,에이전트,길거리,코알라,히로인,보석
# 맵:오락실
# 챌린지:매칭,찾기
# 기타:태블릿,토큰,조이스틱
# 브롤러:재키,드릴
# 스킨:대릴,마스코트,페니,토끼,엠즈,대학생,마이크,너구리,호루스
# 가젯:스프라우트,로사,크로우,브록,다이너마이트,리코,맥스,대릴,발리,프랭크,제시,타라,스파이크,포코,재키,쉘리,
# 시스템:더독,트로피
# 이벤트맵:티켓,럼블
# 카카오:카카오
# 오류:오류


filename = 'update_word_csv_v06.csv'
df = pd.read_csv(filename,index_col=0)

df.loc[0,'word'] = ','.join(['재키','드릴','대릴','마스코트','페니','토끼','엠즈','대학생','마이크','너구리','호루스',
                             '스프라우트','로사','크로우','브록','다이너마이트','리코','맥스','대릴','발리','프랭크','제시','타라','스파이크',
                             '포코','재키','쉘리',
                             '더독','트로피','티켓','럼블','카카오','오류'])
df.loc[1,'word'] = ','.join(['미스터','로봇','깡통','핫존','바이러스','비비','닌자','큐피트','에이전트','길거리','코알라','히로인',
                 '보석','오락실','매칭','찾기','태블릿','토큰','조이스틱'])

print(df['word'][0])
print(df['word'][1])

df.to_csv('update_word_remake.csv')